[
  {
    "id": 0,
    "titulo": "",
    "texto": "",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 1,
    "titulo": "¿Cómo saber si un algoritmo es digno de tu confianza?",
    "texto": "Algoritmos para presos: El caso RisCanvi",
    "position": "center",
    "cables_escena": 0
  },
  {
    "id": 2,
    "titulo": "",
    "texto": "A día de hoy encontramos algoritmos en todos los rincones de nuestras vidas. Al tiempo, cada vez se <strong>automatizan más decisiones</strong> que nos afectan. ¿Qué supone esto? Que estamos dejando a los algoritmos decidir sobre nuestras vidas.<br /><br />Por ejemplo, en España existe un algoritmo, <strong>RisCanvi,</strong> que es utilizado por los funcionarios en las cárceles de Cataluña para predecir el riesgo de reincidencia de sus presos.",
    "position": "right",
    "cables_escena": 1
  },
  {
    "id": 3,
    "titulo": "El caso RisCanvi",
    "texto": "Según se ha publicado, los funcionarios que utilizan RisCanvi están de acuerdo con la predicción de reincidencia que hace el algoritmo en el <strong>96,8% de las ocasiones.</strong><br />Es decir, que en <strong> más de 9 casos de cada 10 </strong> los funcionarios <strong>aceptan</strong> la predicción que el algoritmo ha hecho sobre la posible reincidencia futura de un preso.",
    "position": "center",
    "cables_escena": 2
  },
  {
    "id": 4,
    "titulo": "",
    "texto": "Que los funcionarios estén conformes con la decisión del algoritmo en un porcentaje tan alto de los casos, ¿es un <strong>indicador de éxito o un motivo de preocupación?</strong>",
    "position": "right",
    "cables_escena": 3
  },
  {
    "id": 5,
    "titulo": "",
    "texto": "Depende.<br />Si el algoritmo acierta mucho, es de esperar que los funcionarios acepten lo que el sistema predice.<br /><br />Pero <strong>si el algoritmo no acierta demasiado</strong> y los funcionarios están de acuerdo con él, entonces deberíamos preocuparnos.",
    "position": "right",
    "cables_escena": 4
  },
  {
    "id": 6,
    "titulo": "",
    "texto": "Por ello, es necesario comprender hasta qué punto los algoritmos de ayuda a la decisión, como RisCanvi, aciertan o no.<br /><br /> ¿Parece sencillo, verdad? <strong>Pues no lo es.</strong>",
    "position": "right",
    "cables_escena": 5
  },
  {
    "id": 7,
    "titulo": "¿Cómo saber si un algoritmo acierta?",
    "texto": "Para medir el acierto de un algoritmo se utilizan varios tipos de medidas: medidas generales y muy conocidas, como <strong>la exactitud o accuracy;</strong> medidas que hablan de la capacidad del algoritmo, como las medidas de <strong>sensibilidad y especificidad;</strong> o medidas que indican su poder predictivo, como la medida del <strong>valor predictivo.</strong>",
    "position": "center",
    "cables_escena": 6
  },
  {
    "id": 8,
    "titulo": "",
    "texto": "Vamos a explicar qué nos indican estas medidas utilizando el ejemplo de RisCanvi. <br /></br /> Y empezaremos con <strong>la sensibilidad y la especificidad,</strong> que como decíamos son medidas que nos hablan de la capacidad del sistema.",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 9,
    "titulo": "",
    "texto": "Imaginemos que partimos de una muestra de <strong>648 presos</strong> que fueron etiquetados en su día con RisCanvi como de alto o bajo riesgo y a los que luego hemos hecho seguimiento para comprobar si realmente reincidieron o no cuando salieron de la cárcel. <br /><br />Separamos esta muestra entre los que realmente <strong>reincidieron</strong> y los que <strong>no reincidieron.</strong>",
    "position": "right",
    "cables_escena": 7
  },
  {
    "id": 10,
    "titulo": "",
    "texto": "¿Qué capacidad tiene el algoritmo para <strong>detectar a los presos reincidentes</strong> entre toda la muestra?<br /><br />Esta capacidad del algoritmo se conoce como <strong>Sensibilidad</strong> del sistema.",
    "position": "right",
    "cables_escena": 8
  },
  {
    "id": 11,
    "titulo": "",
    "texto": "En el caso de RisCanvi, <strong>la sensibilidad del algoritmo es de un 77%,</strong> es decir, que el sistema es capaz de detectar a casi 8 presos reincidentes de cada 10.",
    "pregunta": "",
    "position": "right",
    "cables_escena": 9
  },
  {
    "id": 12,
    "titulo": "",
    "texto": "Los otros <strong>2 presos reincidentes no detectados</strong> por el sistema son <strong>falsos negativos,</strong> es decir, presos reincidentes que el algoritmo no es capaz de detectar.",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 13,
    "titulo": "",
    "texto": "¿Y qué pasa con <strong>los presos que al salir de la cárcel no reinciden?</strong> ¿Es capaz el algoritmo de detectarlos adecuadamente?",
    "position": "right",
    "cables_escena": 10
  },
  {
    "id": 14,
    "titulo": "",
    "texto": "Para responder a esto, se utiliza la medida de <strong>Especificidad.</strong>",
    "position": "right",
    "cables_escena": 11
  },
  {
    "id": 15,
    "titulo": "",
    "texto": "En RisCanvi, <strong>la especificidad es de un 57%,</strong> es decir, que el sistema es capaz de detectar a casi 6 presos de cada 10 que no reincidieron.",
    "position": "right",
    "cables_escena": 12
  },
  {
    "id": 16,
    "titulo": "",
    "texto": "El resto, 4 de cada 10 presos, son lo que se conoce como <strong>falsos positivos,</strong> es decir, reclusos que no reincidieron pero que el sistema considera erróneamente como reincidentes.",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 17,
    "titulo": "",
    "texto": "Si bien las medidas de sensibilidad y especificidad nos hablan, como decíamos, de la capacidad del sistema, son medidas que no nos dicen nada sobre <strong>el poder predictivo</strong> del algoritmo.",
    "position": "right",
    "cables_escena": 13
  },
  {
    "id": 18,
    "titulo": "",
    "texto": "Para predecir, por ejemplo en el caso de RisCanvi, <strong>cuál es la probabilidad de que un nuevo recluso reincida en el futuro</strong>, las medidas de sensibilidad y especificidad no nos son útiles.",
    "position": "right",
    "cables_escena": 14
  },
  {
    "id": 19,
    "titulo": "",
    "texto": "Necesitamos una nueva medida para saber si un algoritmo acertará cuando haga una predicción futura. Y, para explicar esta nueva medida, el punto de partida es diferente: <strong>el etiquetado.</strong>",
    "position": "right",
    "cables_escena": 15
  },
  {
    "id": 20,
    "titulo": "",
    "texto": "Así, ahora separamos los presos en dos nuevos grupos: los que han sido <strong>etiquetados de alto riesgo</strong> y los <strong>etiquetados de bajo riesgo.</strong>",
    "position": "right",
    "cables_escena": 16
  },
  {
    "id": 21,
    "titulo": "",
    "texto": "Para conocer el poder predictivo del algoritmo, vamos utilizar la medida de <strong>Valor predictivo positivo</strong>. Esta medida nos muestra la probabilidad de que un nuevo preso etiquetado como de alto riesgo reincida en el futuro.",
    "position": "right",
    "cables_escena": 17
  },
  {
    "id": 22,
    "titulo": "",
    "texto": "En RisCanvi, <strong>el valor predictivo positivo es de un 18%.</strong> Esto significa que solo 2 de cada 10 presos etiquetados de alto riesgo terminarán reincidiento y confirmando así la predicción del algoritmo.<br /><br />Mientras que 8 de cada 10 reclusos no reincidirán a pesar de haber sido etiquetados como de alto riesgo.",
    "position": "right",
    "cables_escena": 18
  },
  {
    "id": 23,
    "titulo": "",
    "texto": "Solo nos queda comentar la medida más conocida y publicitada para medir el acierto de los algoritmos: <strong>la exactitud o accuracy.</strong>",
    "position": "right",
    "cables_escena": 19
  },
  {
    "id": 24,
    "titulo": "",
    "texto": "Esta medida tiene en cuenta la muestra de presos entera. En el caso RisCanvi, <strong>el accuracy del sistema es del 59%</strong>, lo que significa que el algoritmo acierta de forma general en 6 de cada 10 reclusos.",
    "position": "right",
    "cables_escena": 20
  },
  {
    "id": 25,
    "titulo": "",
    "texto": "Rebobinando…<br /><br />Después de revisar las diferentes medida de acierto de los algoritmos, te recordamos que los funcionarios que usan el sistema RisCanvi están de acuerdo con él en el 96,8% de los casos.<br /><br />Es decir, que a pesar de todo lo que hemos visto, <strong> en más de 9 de cada 10 casos</strong> se da por bueno el nivel de riesgo que el algoritmo asigna a cada preso.",
    "position": "center",
    "cables_escena": 21
  },
  {
    "id": 26,
    "titulo": "",
    "texto": "Llegados a este punto, <strong>¿te sientes capaz de evaluar el acierto de un algoritmo?</strong><br />Más allá del ejemplo concreto de RisCanvi, resulta evidente que no es un ejercicio sencillo.",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 27,
    "titulo": "",
    "texto": "A pesar de la dificultad, es importante <strong>conocer y distinguir entre medidas</strong> como la sensibilidad, la especificidad, el accuracy o el valor predictivo de un algoritmo. Si solo nos fijamos en alguna de ellas, nuestra lectura sobre su capacidad y poder predictivo puede ser errónea.<br /><br />Y sí, lo sabemos. Todos preferiríamos que estos temas resultaran más sencillos. Pero, <strong>¡c'est la vie y los sistemas automatizados!</strong>",
    "position": "right",
    "cables_escena": 22
  },
  {
    "id": 28,
    "titulo": "",
    "texto": "Y ahora sí, para acabar, esperamos que esta historia te ayude a decidir si los algoritmos que gobiernan tu vida son <strong>dignos de tu confianza.</strong>",
    "position": "right",
    "cables_escena": 23
  }
]
