[
  {
    "id": 0,
    "titulo": "",
    "texto": "",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 1,
    "titulo": "¿Cómo saber si un algoritmo es digno de tu confianza?",
    "texto": "Algoritmos para presos: El caso RisCanvi",
    "position": "center",
    "cables_escena": 0
  },
  {
    "id": 2,
    "titulo": "",
    "texto": "A día de hoy encontramos algoritmos en todos los rincones de nuestras vidas. Cada vez <strong>se automatizan más procesos de decisión</strong>. Algunos incluso se utilizan para decisiones de <strong>alto calado social</strong>.¿Qué significa esto? Que estamos dejando en manos de algoritmos las decisiones sobre nuestras vidas.<br /><br />Por ejemplo, en España existe un sistema automatizado de ayuda a la decisión, <strong>RisCanvi</strong>, que estima el riesgo de que los reclusos de las cárceles de Cataluña puedan reincidir.",
    "position": "right",
    "cables_escena": 1
  },
  {
    "id": 3,
    "titulo": "Vamos a entrar en detalle. El caso RisCanvi",
    "texto": "Según se ha publicado, los funcionarios que utilizan el sistema de riesgo de reincidencia RisCanvi están conformes con la decisión que toma el algoritmo en el <strong>96,8% de las ocasiones</strong>. Es decir, que <strong>en más de 9 casos de cada 10</strong> los funcionarios <strong>aceptan</strong> el nivel de riesgo que el sistema ha asignado al preso",
    "position": "center",
    "cables_escena": 2
  },
  {
    "id": 4,
    "titulo": "Si los/as funcionarios están conformes con la decisión del algoritmo<br/> ¿esto es indicador de éxito o motivo de preocupación?",
    "texto": ".",
    "position": "right",
    "cables_escena": 3
  },
  {
    "id": 5,
    "titulo": "Depende… pero ¿de qué depende?",
    "texto": "Bueno,si  el algoritmo acierta mucho, y los funcionarios confirman lo que él dice, podemos estar tranquilos porque será un indicador de éxito.<br /><br />Pero, si el algoritmo se está equivocando y los funcionarios dan por buena esa valoración igual podemos empezar a preocuparnos</strong>.",
    "position": "right",
    "cables_escena": 4
  },
  {
    "id": 6,
    "titulo": "Simplificando el asunto, podríamos decir que la clave está en saber si los sistemas automatizados aciertan, o no en sus respuestas.",
    "texto": "Por ello, parece necesario comprender hasta qué punto los sistemas automatizados de ayuda a la decisión aciertan o no.<br /><br />¿Parece sencillo, verdad? <strong>Pues no lo es</strong>.",
    "position": "right",
    "cables_escena": 5
  },
  {
    "id": 7,
    "titulo": "¿Cómo saber si un sistema automatizado acierta?",
    "texto": "Vamos a profundizar un poco más sobre el tema. Son varias las medidas que habitualmente se usan para evaluar el acierto de este tipo de sistemas. Algunas de las más habituales son <strong>accuracy, sensibilidad, especificidad y valor predictivo</strong>.",
    "position": "center",
    "cables_escena": 6
  },
  {
    "id": 8,
    "titulo": "Vamos a explicar qué nos dice cada una de ellas utilizando el ejemplo de RisCanvi.",
    "texto": "Y empezaremos con <strong>la sensibilidad y la especificidad</strong>, que son medidas que nos hablan de la capacidad del sistema.",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 9,
    "titulo": "Dividimos el conjunto de presos entre reincidentes y no reincidentes",
    "texto": "Imaginemos que partimos de nuestra muestra de <strong>648 presos</strong> y entre ellos hay presos que sabemos que han reincidido al salir de la cárcel, y otros presos que no han reincidido.<br /><br />Así que los separamos en esos dos grupos: <strong>reincidentes</strong> y <strong>no reincidentes</strong>.",
    "position": "right",
    "cables_escena": 7
  },
  {
    "id": 10,
    "titulo": "¿Cuál es la capacidad del algoritmo para identificar a los presos reincidentes?",
    "texto": "En primer lugar, el algoritmo etiqueta como “Alto riesgo” a los presos que considera reincidentes. <br /><br />Este dato se calcula dividiendo el número de presos etiquetados de alto riesgo, entre el total de presos reincidentes, y se conoce como <strong>Sensibilidad</strong> del sistema.",
    "position": "right",
    "cables_escena": 8
  },
  {
    "id": 11,
    "titulo": "",
    "texto": "En el caso de RisCanvi, la <strong>sensibilidad del algoritmo es de un 77%</strong>, es decir, que el sistema es capaz de identificar como reincidentes a casi 8 presos de cada 10 que reinciden.",
    "pregunta": "",
    "position": "right",
    "cables_escena": 9
  },
  {
    "id": 12,
    "titulo": "",
    "texto": "Los otros <strong>2 presos</strong> serán reincidentes que el sistema no habrá detectado. Esto se conoce como <strong>falsos negativos</strong>.Es decir, presos reincidentes que el sistema no llega a identificar.",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 13,
    "titulo": "¿Y qué pasa con los presos que al salir de la cárcel no reinciden?",
    "texto": "¿Es capaz el algoritmo de identificarlos adecuadamente?<br /><br />Para responder a esto, se utiliza la medida de <strong>Especificidad</strong>.",
    "position": "right",
    "cables_escena": 10
  },
  {
    "id": 14,
    "titulo": "",
    "texto": "Para saber qué presos no serán reincidentes, l algoritmo etiqueta como “Bajo riesgo” a los presos que considera que no van a reincidir. La <strong>Especificidad</strong> se calcula dividiendo el número de presos etiquetados como  bajo riesgo entre el total de los presos no reincidentes.",
    "position": "right",
    "cables_escena": 11
  },
  {
    "id": 15,
    "titulo": "",
    "texto": "En RisCanvi, <strong>la especificidad es de un 57%</strong>, es decir, que el sistema es capaz de identificar a casi 6 presos no reincidentes de cada 10 que no reinciden. Es decir, el algoritmo estaría acertando en 6 de cada 10 casos.",
    "position": "right",
    "cables_escena": 12
  },
  {
    "id": 16,
    "titulo": "",
    "texto": "El resto, 4 de cada 10 presos, serían lo que conocemos como <strong>falsos positivos</strong>.  Es decir, reclusos no reincidentes que el sistema etiqueta incorrectamente como de alto riesgo.",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 17,
    "titulo": " ¿Significa esto que este sistema puede predecir el futuro?",
    "texto": "Si bien las medidas de sensibilidad y especificidad nos hablan, como decíamos, de la capacidad del sistema, no lo hacen sobre <strong>su poder predictivo</strong>.",
    "position": "right",
    "cables_escena": 13
  },
  {
    "id": 18,
    "titulo": "",
    "texto": "Para predecir, por ejemplo en el caso de RisCanvi, cuál es la probabilidad de que un recluso reincida en el futuro, no nos sirven las medidas de sensibilidad y especificidad",
    "position": "right",
    "cables_escena": 14
  },
  {
    "id": 19,
    "titulo": "",
    "texto": "Para comprobar la capacidad de predicción vamos a fijarnos en el etiquetado. Es decir, en el número de presos etiquetados como “Alto riesgo” y cuantos como “Bajo riesgo”.",
    "position": "right",
    "cables_escena": 15
  },
  {
    "id": 20,
    "titulo": "",
    "texto": "No resulta fácil ¿verdad? Vamos con algunos datos para explicarlo mejor.",
    "position": "right",
    "cables_escena": 16
  },
  {
    "id": 21,
    "titulo": "",
    "texto": "Para predecir si un preso etiquetado como Alto riesgo reincidirá en el futuro, necesitamos conocer la medida <strong>Valor predictivo positivo</strong>.  Este se calcula dividiendo el número de reclusos etiquetados de alto riesgo que terminan reincidiendo, entre el total de presos de alto riesgo.",
    "position": "right",
    "cables_escena": 17
  },
  {
    "id": 22,
    "titulo": "",
    "texto": "En RisCanvi, <strong>el valor predictivo positivo es de un 18%</strong>. Esto significa que entre las personas etiquetadas como “Alto riesgo” sólo 2 de cada 10 presos terminarían confirmando el pronóstico y  reincidiendo. Y la inmensa mayoría, 8 de cada 10 reclusos no reincidirían a pesar de haber sido etiquetados como de “Alto Riesgo”",
    "pregunta": "Los cartelones tapan las letras del suelo. O poner en siglas VPP o hacer más zoom, o ambos",
    "position": "right",
    "cables_escena": 18
  },
  {
    "id": 23,
    "titulo": "",
    "texto": "Solo nos quedaría comentar la medida más conocida y publicitada para medir el acierto de los algoritmos: <strong>la exactitud o accuracy</strong>.<br /><br />",
    "position": "right",
    "cables_escena": 19
  },
  {
    "id": 24,
    "titulo": "",
    "texto": "Esta medida se calcula dividiendo los presos correctamente etiquetados entre el total de la muestra. En el caso RisCanvi, <strong>el accuracy es del 59%</strong>. Esto significa que el sistema acierta con su etiquetado en 6 de cada 10 reclusos. Y falla en su predicción con 4 de cada 10 personas, ya sea de manera positiva o negativa.",
    "position": "right",
    "cables_escena": 20
  },
  {
    "id": 25,
    "titulo": "Rebobinando…",
    "texto": "<h1>Rebobinando</h1> Después de tanta medida te recuerdo que empezamos diciendo que el cumplimiento en el sistema RisCanvi es del 96,8%.<br /><br />Es decir, que a pesar de las medidas de error presentes en el sistema de RisCanvi <strong> en más de 9 de cada 10 casos</strong> se da por bueno el nivel de riesgo asignado por el sistema. ",
    "position": "center",
    "cables_escena": 21
  },
  {
    "id": 26,
    "titulo": "",
    "texto": "Llegados a este punto y después de todo lo que te hemos explicado ¿te sientes capaz de evaluar la capacidad y potencial predictivo de un algoritmo? Más allá del ejemplo concreto de RisCanvi, resulta evidente que no es un ejercicio sencillo.",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 27,
    "titulo": "",
    "texto": "A pesar de la dificultad, es importante <strong>conocer y distinguir entre medidas como la sensibilidad, la especificidad, el accuracy o el valor predictivo</strong>.<br /><br />Si solo nos fijamos en alguna de ellas, nuestra lectura sobre la capacidad y poder predictivo de un algoritmo puede ser errónea. Y sí, lo sabemos. Todos preferiríamos que estos temas resultaran más sencillos. Pero <strong>¡c'est la vie y los sistemas automatizados!</strong>",
    "position": "right",
    "cables_escena": 22
  },
  {
    "id": 28,
    "titulo": "",
    "texto": " Ahora sí, y para acabar, esperamos que esto te ayude a saber si ese algoritmo de tu vida es digno de tu confianza? ",
    "position": "right",
    "cables_escena": 23
  }
]
