[
  {
    "id": 0,
    "titulo": "",
    "texto": "",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 1,
    "titulo": "¿Cómo medir si un algoritmo acierta?",
    "texto": "Algoritmos para presos: el caso RisCanvi",
    "position": "center",
    "cables_escena": 0
  },
  {
    "id": 2,
    "titulo": "",
    "texto": "Cada vez <strong>se automatizan más procesos de decisión</strong> o se usan más sistemas automatizados en decisiones. Algunos incluso se utilizan para decisiones de <strong>calado social</strong>.<br /><br />Por ejemplo, en España existe un sistema automatizado de ayuda a la decisión, <strong>RisCanvi</strong>, que estima el riesgo de que los reclusos de las cárceles de Cataluña puedan reincidir.",
    "position": "right",
    "cables_escena": 1
  },
  {
    "id": 3,
    "titulo": "El caso RisCanvi",
    "texto": "Según se ha publicado<sup>1</sup>, los funcionarios que utilizan el sistema de riesgo de reincidencia RisCanvi están conformes con la decisión que toma el algoritmo en el <strong>96,8% de las ocasiones</strong>.",
    "position": "center",
    "cables_escena": 2
  },
  {
    "id": 4,
    "titulo": "",
    "texto": "Es decir, que <strong>en más de 9 casos de cada 10</strong> los funcionarios <strong>aceptan</strong> el nivel de riesgo que el sistema ha asignado al preso.<br /><br />¿Este porcentaje de cumplimiento por parte de los funcionarios es un <strong>indicador de éxito o es motivo de preocupación</strong>?",
    "position": "right",
    "cables_escena": 3
  },
  {
    "id": 5,
    "titulo": "",
    "texto": "Bueno, si el sistema acierta mucho, que los funcionarios estén de acuerdo con él supone que tomarán buenas decisiones.<br /><br />Eso sí, si el acierto del sistema no es muy alto, este porcentaje de cumplimiento por encima del 95% es <strong>claramente preocupante</strong>.",
    "position": "right",
    "cables_escena": 4
  },

  {
    "id": 6,
    "titulo": "",
    "texto": "Por ello, parece necesario comprender hasta qué punto los sistemas automatizados de ayuda a la decisión aciertan o no.<br /><br />¿Parece sencillo, verdad? <strong>Pues no lo es</strong>.",
    "position": "right",
    "cables_escena": 5
  },
  {
    "id": 7,
    "titulo": "",
    "texto": "¿Cómo saber si un sistema automatizado es acertado?<br />Son varias las medidas que habitualmente se usan para evaluar el acierto de este tipo de sistemas. Algunas de las más habituales son <strong>accuracy, sensibilidad, especificidad y valor predictivo</strong>.",
    "position": "center",
    "cables_escena": 6
  },
  {
    "id": 8,
    "titulo": "",
    "texto": "Pero, ¿qué nos dicen cada una de ellas?<br />Para comprenderlas, usaremos los datos del mencionado sistema RisCanvi como ejemplo<sup>2</sup>.<br /><br /> Y empezaremos con <strong>la sensibilidad y la especificidad</strong>, que son medidas que nos hablan de la capacidad del sistema.",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 9,
    "titulo": "",
    "texto": "Imaginemos que partimos de nuestra muestra de <strong>648 presos</strong> y entre ellos hay presos violentos que sabemos que han reincidido cuando han salido de la cárcel, y presos que no.<br /><br />Así que los separamos en esos dos grupos: <strong>reincidentes</strong> y <strong>no reincidentes</strong>.",
    "position": "right",
    "cables_escena": 7
  },
  {
    "id": 10,
    "titulo": "",
    "texto": "Queremos saber cuál es la capacidad del algoritmo para <strong>detectar a los presos reincidentes</strong> y etiquetarlos de alto riesgo. <br /><br />Este dato se calcula dividiendo el número de presos etiquetados de alto riesgo, entre el total de presos reincidentes, y se conoce como <strong>Sensibilidad</strong> del sistema.",
    "position": "right",
    "cables_escena": 8
  },
  {
    "id": 11,
    "titulo": "",
    "texto": "En el caso de RisCanvi, la <strong>sensibilidad del algoritmo es de un 77%</strong>, es decir, que el sistema es capaz de identificar como reincidentes a casi 8 presos de cada 10 que reinciden.",
    "pregunta": "",
    "position": "right",
    "cables_escena": 9
  },
  {
    "id": 12,
    "titulo": "",
    "texto": "Los otros <strong>2 presos de cada 10</strong> que el sistema no detecta serían <strong>falsos negativos</strong>, es decir, presos reincidentes que el sistema no llega a identificar.",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 13,
    "titulo": "",
    "texto": "¿Y qué pasa con los presos que no reinciden? ¿Es capaz el algoritmo de identificarlos adecuadamente?<br /><br />Para responder a esto, se utiliza la medida de <strong>Especificidad</strong>.",
    "position": "right",
    "cables_escena": 10
  },
  {
    "id": 14,
    "titulo": "",
    "texto": "La <strong>Especificidad</strong> se calcula dividiendo el número de presos etiquetados de bajo riesgo entre el total de los presos no reincidentes.",
    "position": "right",
    "cables_escena": 11
  },
  {
    "id": 15,
    "titulo": "",
    "texto": "En RisCanvi, <strong>la especificidad es de un 57%</strong>, es decir, que el sistema es capaz de identificar a casi 6 presos no reincidentes de cada 10 que no reinciden.",
    "position": "right",
    "cables_escena": 12
  },
  {
    "id": 16,
    "titulo": "",
    "texto": "El resto, 4 de cada 10 presos, serían <strong>falsos positivos</strong>, es decir, reclusos no reincidentes que el sistema etiqueta incorrectamente como de alto riesgo.",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 17,
    "titulo": "",
    "texto": "Si bien las medidas de sensibilidad y especificidad nos hablan, como decíamos, de la capacidad del sistema, no lo hacen sobre <strong>su poder predictivo</strong>.",
    "position": "right",
    "cables_escena": 13
  },
  {
    "id": 18,
    "titulo": "",
    "texto": "Para predecir, por ejemplo, cuál es la probabilidad de que un recluso reincida en el futuro, no nos sirven las medidas de sensibilidad y especificidad porque el punto de partida es diferente.",
    "position": "right",
    "cables_escena": 14
  },
  {
    "id": 19,
    "titulo": "",
    "texto": "Si para las medidas anteriores partíamos de la muestra de reclusos reincidentes y no reincidentes, ahora el punto de partida es el etiquetado.",
    "position": "right",
    "cables_escena": 15
  },
  {
    "id": 20,
    "titulo": "",
    "texto": "Ahora en lo que nos vamos a fijar es en cuántos presos han sido <strong>etiquetados de alto riesgo</strong> y cuántos de <strong>bajo riesgo</strong>.",
    "position": "right",
    "cables_escena": 16
  },
  {
    "id": 21,
    "titulo": "",
    "texto": "Para predecir si un preso etiquetado de alto riesgo reincidirá en el futuro, necesitamos conocer la medida <strong>Valor predictivo positivo</strong>, que se calcula dividiendo el número de reclusos etiquetados de alto riesgo que terminan reincidiendo, entre el total de presos de alto riesgo.",
    "position": "right",
    "cables_escena": 17
  },
  {
    "id": 22,
    "titulo": "",
    "texto": "En RisCanvi, <strong>el valor predictivo positivo es de un 18%</strong>, es decir, que casi 2 presos de cada 10 terminarían confirmando el pronóstico y reincidiendo tras haber sido etiquetados de alto riesgo.",
    "pregunta": "Los cartelones tapan las letras del suelo. O poner en siglas VPP o hacer más zoom, o ambos",
    "position": "right",
    "cables_escena": 18
  },
  {
    "id": 23,
    "titulo": "",
    "texto": "Solo nos quedaría comentar la medida más conocida y publicitada para medir el acierto de los algoritmos: <strong>la exactitud o accuracy</strong>.<br /><br />Esta medida se calcula dividiendo los presos correctamente etiquetados entre el total de la muestra. En el caso RisCanvi, <strong>el accuracy es del 59%</strong>.",
    "position": "right",
    "cables_escena": 19
  },
  {
    "id": 24,
    "titulo": "",
    "texto": "<h1>Rebobinando</h1> Revisadas algunas de las medidas de acierto de los sistemas automatizados, recordamos que el cumplimiento en el sistema RisCanvi es del 96,8%.<br /><br />Es decir, que <strong>en más de 9 de cada 10 casos</strong> se da por bueno el nivel de riesgo asignado por el sistema.",
    "position": "center",
    "cables_escena": 20
  },
  {
    "id": 25,
    "titulo": "",
    "texto": "Más allá del ejemplo concreto de RisCanvi, parece claro que evaluar la capacidad y el potencial predictivo de un algoritmo <strong>no resulta sencillo</strong>.",
    "position": "right",
    "cables_escena": false
  },
  {
    "id": 26,
    "titulo": "",
    "texto": "Por ello, es importante <strong>conocer y distinguir entre medidas como la sensibilidad, la especificidad, el accuracy o el valor predictivo</strong>.<br /><br />Si solo nos fijamos en alguna de ellas, nuestra lectura sobre la capacidad y poder predictivo de un algoritmo puede ser errónea.",
    "position": "right",
    "cables_escena": 21
  },
  {
    "id": 27,
    "titulo": "",
    "texto": "<h1>Créditos, Datos y Agradecimientos</h1> Y sí, lo sabemos. Todos preferiríamos que estos temas resultaran más sencillos. Pero <strong>¡c'est la vie y los sistemas automatizados!</strong>",
    "position": "right",
    "cables_escena": 22
  }
]
